Repository: jhonny1994/salatracker
Catalog: lib/core/localization/gen/l10n/intl_*.arb
Languages: ar, fr

# appTitle
source: Salat Tracker
ar: سجل الصلاة

# navToday
source: Today
ar: اليوم
fr: Aujourd'hui

# navCalendar
source: Calendar
ar: التقويم
fr: Calendrier

# navSettings
source: Settings
ar: الإعدادات
fr: Paramètres

# prayerFajr
source: Fajr
ar: الفجر

# prayerDhuhr
source: Dhuhr
ar: الظهر

# prayerJumuah
source: Jumu'ah
ar: الجمعة

# prayerAsr
source: Asr
ar: العصر

# prayerMaghrib
source: Maghrib
ar: المغرب

# prayerIsha
source: Isha
ar: العشاء

# todayProgress
source: Today's Progress
ar: تقدم اليوم
fr: Progrès d'aujourd'hui

# todayComplete
source: All prayers completed!
ar: جميع الصلوات مكتملة!
fr: Toutes les prières complétées !

# todayPartial
source: {count} of 5 prayers logged
ar: {count} من 5 صلوات مسجلة
fr: {count} sur 5 prières enregistrées

# todayNone
source: No prayers logged yet
ar: لم يتم تسجيل أي صلاة بعد
fr: Aucune prière enregistrée

# todayStreak
source: {count} day streak
ar: سلسلة {count} يوم
fr: Série de {count} jours

# todayPoints
source: {count} points
ar: {count} نقطة

# todayEncouragement
source: Keep going, you're doing great!
ar: استمر، أنت تبلي حسنًا!
fr: Continuez, vous êtes formidable !

source: Tap to log
ar: انقر للتسجيل
fr: Appuyez pour enregistrer

# settingsAppearance
source: Appearance
ar: المظهر
fr: Apparence

# settingsTheme
source: Theme
ar: السمة
fr: Thème

# settingsThemeLight
source: Light
ar: فاتح
fr: Clair

# settingsThemeDark
source: Dark
ar: داكن
fr: Sombre

# settingsThemeSystem
source: System
ar: النظام
fr: Système

# settingsLanguage
source: Language
ar: اللغة
fr: Langue

# settingsPreferences
source: Preferences
ar: التفضيلات
fr: Préférences

# settingsNotifications
source: Notifications
ar: الإشعارات

# settingsNotificationsSubtitle
source: Enable prayer time alerts
ar: تفعيل تنبيهات أوقات الصلاة
fr: Activer les alertes de prière

# settingsHaptics
source: Haptic Feedback
ar: الاهتزاز اللمسي
fr: Retour Haptique

# settingsHapticsSubtitle
source: Vibrate on interactions
ar: اهتزاز عند التفاعل
fr: Vibrer aux interactions

# settingsShowPoints
source: Show Points
ar: إظهار النقاط
fr: Afficher les Points

# settingsShowPointsSubtitle
source: Display points in UI
ar: عرض النقاط في الواجهة
fr: Afficher les points dans l'interface

# settingsAppLock
source: App Lock
ar: قفل التطبيق
fr: Verrouillage de l'app

# settingsAppLockSubtitle
source: Require unlock after screen off
ar: طلب فتح القفل بعد إطفاء الشاشة
fr: Exiger un déverrouillage après écran éteint

# settingsResetPin
source: Reset PIN
ar: إعادة تعيين رمز PIN
fr: Réinitialiser le PIN

# settingsResetPinSubtitle
source: Set a new app lock PIN
ar: تعيين رمز PIN جديد لقفل التطبيق
fr: Définir un nouveau PIN de verrouillage

# settingsAbout
source: About
ar: حول
fr: À propos

# settingsAppVersion
source: App Version
ar: إصدار التطبيق
fr: Version de l'Application

# settingsVersionLoading
source: Loading...
ar: جار التحميل...
fr: Chargement...

# settingsPrivacyPolicy
source: Privacy Policy
ar: سياسة الخصوصية
fr: Politique de Confidentialité

# settingsPrayerSchedule
source: Prayer Schedule
ar: مواعيد الصلاة
fr: Horaires de prière

# settingsPrayerScheduleSubtitle
source: Set custom prayer times
ar: ضبط مواعيد الصلاة يدويًا
fr: Définir les horaires manuellement

# settingsBadges
source: Badges
ar: الشارات

# settingsBadgesSubtitle
source: View reflective milestones
ar: عرض إنجازاتك التحفيزية
fr: Voir les jalons réflexifs

# errorLoadingSettings
source: Failed to load settings
ar: فشل تحميل الإعدادات
fr: Échec du chargement des paramètres

# errorRetry
source: Retry
ar: إعادة المحاولة
fr: Réessayer

# routerError
source: Route error
ar: خطأ في المسار
fr: Erreur de route

# errorLoadingCalendar
source: Failed to load calendar
ar: فشل تحميل التقويم
fr: Échec du chargement du calendrier

# calendarStreamRetry
source: Stream will retry automatically
ar: سيتم إعادة المحاولة تلقائيًا
fr: Nouvelle tentative automatique

# calendarNoData
source: No prayers logged for this day
ar: لا توجد صلوات مسجلة لهذا اليوم
fr: Aucune prière enregistrée pour ce jour

# calendarCompleted
source: Completed
ar: مكتمل
fr: Complété

# calendarPoints
source: Points
ar: النقاط

# calendarPrayers
source: Prayers
ar: الصلوات
fr: Prières

# calendarNoPrayers
source: No prayers logged
ar: لا توجد صلوات مسجلة
fr: Aucune prière enregistrée

# calendarLoggedAt
source: Logged at {time}
ar: سُجِّل في {time}
fr: Enregistré à {time}

source: Today
ar: اليوم
fr: Aujourd'hui

source: Error loading data
ar: خطأ في تحميل البيانات
fr: Erreur de chargement des données

# historyEditWarningTitle
source: Edit History?
ar: تعديل التاريخ؟
fr: Modifier l'historique ?

# historyEditWarningBody
source: Changing past records may affect your streak and points.
ar: تغيير السجلات السابقة قد يؤثر على السلسلة والنقاط.
fr: La modification des enregistrements passés peut affecter votre série et vos points.

# actionCancel
source: Cancel
ar: إلغاء
fr: Annuler

# actionContinue
source: Continue
ar: استمرار
fr: Continuer

# settingsReminderOffset
source: Reminder Offset
ar: وقت التنبيه
fr: Décalage du rappel

# settingsReminderOffsetSubtitle
source: Adjust when you get notified
ar: تعديل وقت الإشعار
fr: Ajuster l'heure de notification

# offsetMinutes
source: {minutes} min
ar: {minutes} دقيقة

# settingsWeekStart
source: Week Start
ar: بداية الأسبوع
fr: Début de la semaine

# weekStartSunday
source: Sunday
ar: الأحد
fr: Dimanche

# weekStartMonday
source: Monday
ar: الاثنين
fr: Lundi

# notificationTitle
source: Time for {prayer}
ar: وقت {prayer}
fr: L'heure de {prayer}

# notificationBody
source: It is time for {prayer} prayer.
ar: حان الآن وقت صلاة {prayer}
fr: C'est l'heure de la prière de {prayer}

# notificationChannelName
source: Prayer Notifications
ar: إشعارات الصلاة
fr: Notifications de prière

# notificationChannelDescription
source: Notifications for prayer times
ar: إشعارات لمواقيت الصلاة
fr: Notifications pour les horaires de prière

# endOfDayTitle
source: Daily Reflection
ar: تذكير يومي
fr: Réflexion quotidienne

# endOfDayBody
source: Did you complete all your prayers today?
ar: هل أتممت صلواتك اليوم؟
fr: Avez-vous terminé toutes vos prières aujourd'hui ?

# onboardingWelcomeTitle
source: Welcome to Salat Tracker
ar: مرحباً بك في سجل الصلاة
fr: Bienvenue sur Salat Tracker

# onboardingWelcomeBody
source: Track your daily prayers with gentle reminders.
ar: تتبع صلواتك اليومية مع تذكيرات لطيفة.
fr: Suivez vos prières quotidiennes avec des rappels doux.

# onboardingPrayerTimesTitle
source: Set Your Prayer Times
ar: حدد مواعيد الصلاة
fr: Définissez vos Horaires

# onboardingPrayerTimesBody
source: Configure when each prayer time begins.
ar: قم بتعيين وقت بدء كل صلاة.
fr: Configurez l'heure de début de chaque prière.

# onboardingNotificationsTitle
source: Stay on Track
ar: ابقَ على المسار
fr: Restez sur la Bonne Voie

# onboardingNotificationsBody
source: Would you like friendly reminders?
ar: هل تريد تذكيرات لطيفة؟
fr: Souhaitez-vous des rappels amicaux ?

# onboardingAppLockTitle
source: Protect Your Privacy
ar: احمِ خصوصيتك
fr: Protégez Votre Vie Privée

# onboardingAppLockBody
source: Secure your prayer log with biometrics or PIN.
ar: أمّن سجل صلاتك ببصمة أو رمز PIN.
fr: Sécurisez votre journal de prière avec biométrie ou PIN.

# onboardingConfirmTitle
source: You're All Set
ar: أنت جاهز
fr: Vous êtes Prêt

# onboardingConfirmBody
source: Review your settings and start tracking.
ar: راجع إعداداتك وابدأ التتبع.
fr: Vérifiez vos paramètres et commencez.

# onboardingSkip
source: Skip
ar: تخطي
fr: Passer

# onboardingNext
source: Next
ar: التالي
fr: Suivant

# onboardingBack
source: Back
ar: رجوع
fr: Retour

# onboardingGetStarted
source: Get Started
ar: ابدأ الآن
fr: Commencer

# onboardingEnableNotifications
source: Enable Notifications
ar: تفعيل الإشعارات
fr: Activer les Notifications

# onboardingEnableAppLock
source: Enable App Lock
ar: تفعيل قفل التطبيق
fr: Activer le Verrouillage

# onboardingMaybeLater
source: Maybe Later
ar: ربما لاحقاً
fr: Plus tard

# securitySetPinTitle
source: Set a 6-digit PIN
ar: عيّن رمز PIN مكوّن من 6 أرقام
fr: Définir un PIN à 6 chiffres

# securityCurrentPinTitle
source: Enter current PIN
ar: أدخل رمز PIN الحالي
fr: Entrez le PIN actuel

# securityCurrentPinLabel
source: Current PIN
ar: رمز PIN الحالي
fr: PIN actuel

# securityPinLabel
source: PIN
ar: رمز PIN

# securityConfirmPinLabel
source: Confirm PIN
ar: تأكيد رمز PIN
fr: Confirmer le PIN

# securityPinDigitsError
source: PIN must be exactly 6 digits
ar: يجب أن يتكون رمز PIN من 6 أرقام
fr: Le PIN doit contenir exactement 6 chiffres

# securityPinMismatchError
source: PINs do not match
ar: رمزا PIN غير متطابقين
fr: Les PIN ne correspondent pas

# securityCurrentPinError
source: Current PIN is incorrect
ar: رمز PIN الحالي غير صحيح
fr: Le PIN actuel est incorrect

# securityUnlockTitle
source: Unlock Salat Tracker
ar: افتح سجل الصلاة
fr: Déverrouiller Salat Tracker

# securityBiometricReason
source: Authenticate to unlock Salat Tracker
ar: يرجى التحقق لفتح سجل الصلاة
fr: Authentifiez-vous pour déverrouiller Salat Tracker

# settingsBiometricUnlock
source: Biometric Unlock
ar: الفتح بالبصمة
fr: Déverrouillage biométrique

# settingsBiometricUnlockSubtitle
source: Use biometrics before PIN on lock screen
ar: استخدام البصمة قبل رمز PIN في شاشة القفل
fr: Utiliser la biométrie avant le PIN sur l'écran verrouillé

# settingsBiometricUnlockUnavailable
source: Biometrics unavailable on this device
ar: البصمة غير متاحة على هذا الجهاز
fr: Biométrie indisponible sur cet appareil

# settingsCurrentTimezone
source: Current Time Zone
ar: المنطقة الزمنية الحالية
fr: Fuseau horaire actuel

# settingsCurrentTimezoneUnavailable
source: Time zone unavailable
ar: المنطقة الزمنية غير متاحة
fr: Fuseau horaire indisponible

# securityLockoutSeconds
source: Try again in {seconds}s
ar: حاول مرة أخرى بعد {seconds} ثانية
fr: Réessayez dans {seconds}s

# badgesTitle
source: Badges
ar: الشارات

# badgesEmpty
source: No badges yet. Keep logging your prayers.
ar: لا توجد شارات بعد. استمر في تسجيل صلواتك.
fr: Aucun badge pour le moment. Continuez vos prières.

# badgesEarnedOn
source: Earned on {date}
ar: تم الحصول عليها في {date}
fr: Obtenu le {date}

# badgeFirstPrayerName
source: First Prayer Logged
ar: أول صلاة مسجلة
fr: Première prière enregistrée

# badgeFirstPrayerDescription
source: Logged your first prayer entry.
ar: قمت بتسجيل أول صلاة لك.
fr: Vous avez enregistré votre première prière.

# badgeWeekConsistencyName
source: Week of Consistency
ar: أسبوع من الالتزام
fr: Semaine de régularité

# badgeWeekConsistencyDescription
source: Completed 7 full prayer days.
ar: أكملت 7 أيام كاملة من الصلوات.
fr: 7 jours complets de prières validés.

# badgeMonthCompleteName
source: Month Complete
ar: إنجاز الشهر
fr: Mois accompli

# badgeMonthCompleteDescription
source: Reached 90% completion in a month.
ar: حققت 90% إكمال خلال شهر.
fr: 90% de complétion atteints sur un mois.

# badgeSeasonChampionName
source: Season Champion
ar: بطل الموسم
fr: Champion de saison

# badgeSeasonChampionDescription
source: Reached 80% completion in 3 months.
ar: حققت 80% إكمال خلال 3 أشهر.
fr: 80% de complétion atteints sur 3 mois.
